Repository: Akashnilkanth1205/Demoo
Catalog: docs/locale/*/LC_MESSAGES/index.po
Languages: es

source: Self-driving car image browser
es: Navegador de imágenes de coche autónomo

source: Tutorials
es: Tutoriales

source: Topic Guides
es: Guías de temas

source: API cheat sheet
es: Hoja de trucos de API

source: Reference Guides
es: Guías de referencia

source: Discussion forum
es: Foro de debate

source: Frequently Asked Questions
es: Preguntas frecuentes

source: Source code & issue tracker
es: Código fuente & rastreador de problemas

source: Support
es: Soporte

source: Welcome to Streamlit
es: Bienvenido a Streamlit

source: Streamlit is an open-source Python library that makes it easy to create and share beautiful, custom web apps for machine learning and data science. In just a few minutes you can build and deploy powerful data apps - so let's get started!
es: [Streamlit](https://streamlit.io/) es una librería Python de código abierto que facilita la creación y el intercambio de aplicaciones web personalizadas para el aprendizaje automático y la ciencia de datos. En tan solo unos minutos puedes construir y desplegar potentes aplicaciones de datos - ¡así que empecemos!

source: Make sure that you have Python 3.6 - Python 3.8 installed.
es: Asegúrese de que tiene instalado [Python 3.6 - Python 3.8](https://www.python.org/downloads/release/python-386/).

source: Install Streamlit using PIP and run the 'hello world' app:
es: Instala Streamlit mediante [PIP](https://pip.pypa.io/en/stable/installing/) y ejecuta la aplicación 'hello world':

source: That's it! In the next few seconds the sample app will open in a new tab in your default browser.
es: Ya está. En los próximos segundos la aplicación de muestra se abrirá en una nueva pestaña de su navegador predeterminado.

source: Still with us? Great! Now make your own app in just 3 more steps:
es: ¿Sigues con nosotros? ¡Genial! Ahora crea tu propia aplicación en sólo 3 pasos más:

source: Open a new Python file, import Streamlit, and write some code
es: Abre un nuevo archivo de Python, importa Streamlit y escribe algo de código

source: Run the file with:
es: Ejecuta el archivo con:

source: streamlit run [filename]
es: streamlit run [`nombre de archivo`]

source: When you're ready, click 'Deploy' from the Streamlit menu to share your app with the world!
es: Cuando estés listo, haz clic en 'Deploy' en el menú de Streamlit para [compartir tu aplicación con el mundo](deploy_streamlit_app.md)!

source: Now that you're set up, let's dive into more of how Streamlit works and how to build great apps.
es: Ahora que ya estás preparado, vamos a profundizar en el funcionamiento de Streamlit y en cómo crear grandes aplicaciones.

source: How to use our docs
es: Cómo utilizar nuestros documentos

source: The docs are broken up into 5 sections that will help you get the most out of Streamlit.
es: Los documentos están divididos en 5 secciones que te ayudarán a sacar el máximo provecho de Streamlit.

source: Tutorials: include our Get Started guide and a few step-by-step examples to building different types of apps in Streamlit.
es: **Tutoriales**: incluyen [nuestra guía de inicio](getting_started.md) y algunos ejemplos paso a paso para construir diferentes tipos de aplicaciones en Streamlit.

source: Topic guides: give you background on how different parts of Streamlit work. Make sure to check out the sections on Creating an app and Deploying an app, and for you advanced users who want to level up your apps, be sure to read up on Caching and Components.
es: Guías temáticas: te dan información sobre cómo funcionan las diferentes partes de Streamlit. Asegúrate de consultar las secciones sobre [Creación de una aplicación](main_concepts.md) y [Despliegue de una aplicación](deploy_streamlit_app.md), y para los usuarios avanzados que quieran subir de nivel sus aplicaciones, asegúrate de leer sobre [Caché](caching.md) y [Componentes](develop_streamlit_components.md).

source: Cookbook: provides short code snippets that you can copy in for specific use cases.
es: **Libro de cocina**: proporciona breves fragmentos de código que puede copiar para casos de uso específicos.

source: Reference guides: are the bread and butter of how our APIs and configuration files work and will give you short, actionable explanations of specific functions and features.
es: **Guías de referencia**: son el pan de cada día de cómo funcionan nuestras [APIs](api.md) y [archivos de configuración](streamlit_configuration.md) y le darán explicaciones breves y prácticas de funciones y características específicas.

source: Support: gives you more options for when you're stuck or want to talk about an idea. Check out our discussion forum as well as a number of troubleshooting guides.
es: **Soporte**: te da más opciones para cuando estés atascado o quieras hablar de una idea. Echa un vistazo a nuestro foro de debate, así como a una serie de [guías de solución de problemas](/troubleshooting/index.md).

source: Join the community
es: Únete a la comunidad

source: Streamlit is more than just a way to make data apps, it's also a community of creators that share their apps and ideas and help each other make their work better. Please come join us on the community forum. We love to hear your questions, ideas, and help you work through your bugs — stop by today!
es: Streamlit es más que una forma de hacer aplicaciones de datos, es también una comunidad de creadores que comparten sus aplicaciones e ideas y se ayudan mutuamente a mejorar su trabajo. Por favor, únete a nosotros en el [foro de la comunidad](https://discuss.streamlit.io/). Nos encanta escuchar tus preguntas e ideas, y ayudarte a resolver tus errores!
